Revit 2026 API

# ElectricalSystemRating Property

---

The Rating value of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Rating { get; set; }
```
```vb
Public Property Rating As Double
	Get
	Set
```
```cpp
public:
property double Rating {
	double get ();
	void set (double value);
}
```
```fsharp
member Rating : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The given value for rating is not a number -or- When setting this property: The given value for rating is not finite |
| ArgumentOutOfRangeException | When setting this property: The given value for rating must be non-negative. |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the Rating value of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace